{
    "header":{
      "homeText": "Home",
      "aboutText": "About",
      "experienceText": "Experience",
      "projectsText": "Projects",
      "awardsText": "Awards",
      "contactText": "Contact",
      "homePath": "/",
      "aboutPath": "/about",
      "experiencePath": "/experience",
      "projectsPath": "/projects",
      "awardsPath": "/awards",
      "contactPath": "/contact"
    },
    "home": {
      "resumeLink": "/documents/SophieStupaloOfficialResume.pdf",
      "emailLink": "mailto:sophie@stupalo.com",
      "emailText": "sophie@stupalo.com",
      "phoneLink": "tel:6476339839",
      "phoneText": "647 633 9839",
      "educationLink": "https://uwaterloo.ca/biomedical-engineering/?utm_source=uwaterloo.ca%2Fengineering&utm_medium=site&utm_campaign=analytics",
      "aboutMeParagraph": "Welcome to my website! I’m Sophie Stupalo, a 2024 biomedical engineering graduate from the University of Waterloo. My passion lies at the intersection of medicine and innovation, with the ultimate goal of becoming a physician and contributing to the development of novel medical devices or administrative tools that improve patient outcomes and reduce physician burnout. I am deeply committed to advocating for equitable access to care and enhancing Canada's universal healthcare system, all while safeguarding it from the threat of privatization.\n\nIf you'd like to learn more about my journey, keep reading.\n\nThroughout my life, I've often started from behind but have always worked my way to the top through dedication and perseverance. Take my hockey journey, for instance. When I switched from boys’ recreational hockey to girls’ competitive hockey, my parents encouraged me to tryout for every level, from AA to B. I secured one of the last spots on the B team, but I made the most of every opportunity—multiple practices a week, extra power skating sessions—and by the end of the season, I was one of the best players. This pattern of growth and relentless improvement repeated every year until I earned a spot on the AA team in my final year of high school.\n\nEven after leaving competitive hockey, I continued applying my goal-driven work ethic to other areas, particularly my university studies. Coming from a basic public high school, I initially felt behind classmates who had more advanced academic backgrounds from IB, AP, or private schools. Yet, through hard work and determination, I became the top student in my class in my 4A term.\n\nA significant part of my university experience was about seeking out opportunities for growth and self-discovery. My aspirations were shaped by my final co-op term at Trudell Medical International (more details on my Experience page), founding the University of Waterloo Lacrosse Club, and working on my fourth-year design project (see the Projects page).\n\nIf you're looking for someone who may not know all the answers right away but has the curiosity, resourcefulness, and drive to figure things out and achieve meaningful results, you've come to the right place. Explore further, and feel free to reach out with any questions.",
      "profileImage": "/images/headshot.jpg",
      "fullImage": "/images/fullpage.jpg"
    },
    "experience":{
      "experienceList":[
        {
          "id": 1,
          "company": "Trudell Medical International",
          "position": "New Product Development Engineering Intern",
          "dates": "Jan 2023 - Aug 2023",
          "image": "/images/trudell.png",
          "content": "At Trudell Medical International, a leading medical device manufacturer focused on improving respiratory health, I worked as a New Product Developer Intern within the 3D printing, early-phase, and late-phase product development teams.\n\nAs part of the 3D printing team, I managed the preparation and processing of nightly print jobs for engineers across the company using the ProJet 6000 HD and Figure 4 Standalone SLA printers. This included setting up build plates, cleaning and curing parts, and ensuring timely delivery, while refining health and safety protocols for enhanced operations.\n\nIn the early-phase group, I contributed to the redesign of the company’s flagship product by prototyping facemasks and developing testing protocols to evaluate fit and comfort across various face shapes. I created these prototypes in-house, combining 3D-printed bases with silicone injection-molded seals. Designing and 3D-printing molds for the injection molding process gave me valuable insight into the manufacturing considerations for mold design. Additionally, I coordinated patient interviews, which provided critical feedback to guide design improvements.\n\nIn the late-phase group, I supported a capability analysis to uphold high manufacturing standards following a tool transfer. I also investigated parts with high rejection rates, identifying root causes, and collaborated in designing an automated testing fixture to ensure that a flexible part met specification requirements.\n\n Overall, my contributions across all teams were essential in aligning the product with both user needs and manufacturing standards."
        },
        {
          "id": 2,
          "company": "GoFleet / Zenduit",
          "position": "Product Manager",
          "dates": "May 2022 - Aug 2022",
          "image": "/images/gofleet.png",
          "content": "GoFleet and Zenduit are telematics solutions providers that optimize fleet management across various industries. During my 4-month co-op as a Product Manager, I took full ownership of two software products: ZenduTimeCard and the Support Ticket add-in. I also designed and implemented a self-serve model for ZenduWork, developed user journeys for a marketplace application, and collaborated with designers and developers to launch multiple websites and landing pages.\n\nZenduTimeCard is a time-tracking solution that leverages location tracking to automate employee hour logging and integrates with payroll systems, reducing errors for HR teams. The Support Ticket add-in provides a dashboard for administrators to manage service requests efficiently. My “complete ownership” of these products involved identifying bugs, gathering user feedback, designing features, writing development tickets, prioritizing tasks, and creating both written and video documentation.\n\nFor the ZenduWork self-serve model, I mapped out user journeys to guide new users through account creation, feature discovery, and work order management. I also worked with a designer on intuitive UI screens, crafted onboarding emails, and oversaw initial development.\n\nThis role taught me how to create user-centric journeys, manage projects using modular ToDo lists, and effectively communicate progress to stakeholders."
        },
        {
          "id": 3,
          "company": "Christie Digital Systems",
          "position": "Agile Software Developer",
          "dates": "Sept 2021 - Dec 2021",
          "image": "/images/christie.png",
          "content": "Christie is a global leader in audio-visual solutions, dedicated to delivering exceptional experiences through their cutting-edge AV technologies and display products. As an Agile Software Developer, I contributed to the development of both the Mystique and Mystique Design Web (MDW) products, actively participating in regular agile sprint meetings and contributing to various phases of development.\n\nMystique is an automated, camera-based alignment and recalibration solution designed to simplify the installation, alignment, and maintenance of multi-projection systems. MDW is a web application that enables users to simulate multi-projection setups, allowing for pre-installation testing of the Mystique software’s performance.\n\nMy primary project during the term was to develop a feature within MDW that simulates color divergence and chromatic aberration. This involved full-stack development, where I enhanced the ReactJS UI to allow users to manipulate the translation, rotation, and scale of red, green, and blue pixels for each projector. On the backend, I utilized C++, CUDA, and OpenGL shaders to implement the pixel transformation logic and accurately visualize how these changes would affect the final projection.\n\nIn addition to my main project, I consistently addressed bug fixes, ensuring the reliability and performance of both products."
        },
        {
          "id": 4,
          "company": "University of Waterloo",
          "position": "Developer Research Assitant",
          "dates": "Jan 2021 - Apr 2021",
          "image": "/images/uwaterloo.png",
          "content": "As a Developer Research Assistant in the Department of Management Sciences at the University of Waterloo, I addressed the department's need for a new data visualization tool to support their accreditation processes. Under the supervision of Dr. Mehrdad Pirnia, I designed and implemented a custom R Shiny web application that streamlined the consolidation of student data and generated dynamic tables and graphs for CEAB outcomes-based assessment reporting. The application was deployed on a remote Shiny Server with a MySQL database for real-time data access.\n\nWhile I independently led the development, I employed an agile methodology, conducting weekly feedback sessions with Dr. Pirnia, the primary stakeholder, to iterate on feature enhancements and ensure alignment with evolving requirements."
        },
        {
          "id": 5,
          "company": "Gumstix Research Canada",
          "position": "Platform Developer Intern",
          "dates": "May 2020 - Aug 2020",
          "image": "/images/gumstix.png",
          "content": "Gumstix is an online marketplace for customizable embedded electronic hardware. During my term as a platform developer intern, I contributed to developing hardware-specific embedded Linux distributions for custom PCB assemblies using the Yocto Project. Early on, I was tasked with diagnosing issues in Gumstix images that were not executing properly by investigating the Linux file system and presenting potential solutions. This process helped me become familiar with the hardware I would work with throughout my term.\n\nLater, I was responsible for updating the Gumstix meta layers and Yocto manifests to be compatible with Dunfell, the latest Yocto release at the time. In this role, I learned to configure PCB assemblies by modifying Device Tree Source files using overlays and parameters, such as pin multiplexing, to alter the physical behavior of targeted GPIOs.\n\nToward the end of my term, I tackled the challenge of enabling automatic detection and setup for two different Bluetooth/WiFi chip configurations. This involved writing Yocto recipes to install a module, initialization tool, service, and udev rule file on custom images. This internship was particularly demanding due to the remote nature of the work, necessitated by COVID-19, and the need to quickly learn Linux, Yocto, and various hardware components. However, the experience strengthened my resilience, resourcefulness, and ability to seek help when needed."
        },
        {
          "id": 6,
          "company": "Treetop Trekking",
          "position": "Aerial Guide",
          "dates": "Mar 2019 - Mar 2020",
          "image": "/images/treetoptrekking.png",
          "content": "Treetop Trekking Brampton is an aerial park located in the Heart Lake Conservation Area. As an Aerial Guide, I conducted orientations, interacted with customers, and supervised park courses to ensure participant safety. My responsibilities also included daily safety inspections of equipment and courses. Working with large school and camp groups, I developed strong communication skills, often adapting orientation information for non-English speakers, as the park attracts many tourists. Within this role, I consistently prioritized safety while delivering an enjoyable experience for all visitors."
        },
        {
          "id": 7,
          "company": "City of Brampton",
          "position": "Lifeguard & Swim Instructor",
          "dates": "Sep 2017 - Aug 2019",
          "image": "/images/brampton.png",
          "content": "Throughout high school, I worked part-time as a lifeguard and swim instructor for the City of Brampton, where I maintained all necessary physical and lifesaving certifications. As a swim instructor, I demonstrated and evaluated swimming techniques, communicated students' progress to parents/guardians, and ensured the safety of every participant. Additionally, on select weekends, I assisted with teaching advanced lifesaving courses, including Bronze Cross and Standard First Aid."
        },
        {
          "id": 8,
          "company": "Wet'n'Wild Toronto",
          "position": "Lifeguard",
          "dates": "Apr 2017 - Sep 2017",
          "image": "/images/wetnwild.png",
          "content": "My first paid job was as a lifeguard at Wet 'n' Wild Toronto, a bustling waterpark known for its exhilarating rides. In this role, I worked alongside other dedicated lifeguards, ensuring the safety of swimmers in a fast-paced environment. During my employment, I led 11 successful rescues and provided critical support in countless others, gaining valuable experience in teamwork, leadership, and emergency response."
        }
      ]
    },
    "projects":{
      "projectList":[
        {
          "id": 11,
          "title": "PressurePro",
          "subtitle": "Fourth Year Design Project",
          "date": "2022 - 2024",
          "typeId": ["School"],
          "image": "/images/capstone/cover.jpg",
          "content": "To complete my biomedical engineering degree at the University of Waterloo, I participated in a capstone project, a team-based design project that is intended to showcase the skills we developed throughout the program. Our team chose to address a critical healthcare challenge: preventing pressure ulcers in wheelchair users. Specifically, we developed an accessory device for the ROHO® QUADTRO SELECT® HIGH PROFILE® air-filled wheelchair cushion that dynamically maintains ideal pressure levels in each quadrant, as prescribed by an occupational therapist.\n\nUnlike many engineering disciplines, our capstone project spanned multiple academic terms (3B, 4A, and 4B), allowing us to thoroughly practice the engineering design process. During the 3B term, our focus was on conducting a comprehensive needs assessment. By 4A, we had identified the specific problem to solve and had worked closely with patients, occupational therapists, and general practitioners to understand the issue’s root causes and define clear requirements and constraints for our solution.\n\nOur ideation phase began with a brainstorming session loosely based on the Lightning Decision Jam methodology. Each team member then independently created two distinct design sketches, which we evaluated against our requirements using a Best of Class Chart. This analysis led us to select the most plausible solution to pursue in further design stages.\n\nGiven my prior product development experience, I anticipated the challenges of managing a complex project like this. To ensure our success, I created a shared Notion workspace for the team, organizing tasks with a Work Breakdown Structure and setting internal deadlines. This was a vital tool in keeping us accountable and on track, enabling us to create three prototypes—low, medium, and high fidelity—while many teams only managed one or two. Further, testing these prototypes highlighted flaws early, allowing us to refine our designs significantly before constructing the final version.\n\nAs the project progressed, we divided into two sub-teams: electrical and mechanical design, and software and algorithm development. I took on the role of Lead Electrical Designer, responsible for designing the electrical schematics for all three prototypes, including the user interface. Once the schematics were complete, I led the sourcing of components, critically evaluating options with my teammates to optimize features like battery life.\n\nBeyond my electrical responsibilities, I embraced several mechanical design tasks due to my interest in the field. One of my favourite tasks was reverse engineering the ROHO cushion’s spool valve, which controls air distribution across its quadrants in the manufacturer’s original design. Once I had created the initial design for this interface component, further iterations focused on reducing its size to avoid creating new pressure points under a user’s thighs. Another key mechanical task was designing the housing for the high-fidelity prototype. Using SolidWorks, I created 3D models of all components and organized them in an assembly that prioritized maintaining straight tubes connections between the different components.\n\nTo manufacture the housing and spool valve, I completed online and in-person training to use the large-format filament and SLA 3D printers available in the WatiMAKE lab, as my personal 3D printer was not suitable for these tasks. Additionally, I constructed and soldered all three prototypes, ensuring they were fully functional for testing.\n\nThroughout the project, I meticulously documented every meeting and work session in an engineering logbook, which totaled 146 entries by the project’s conclusion. This logbook maintained traceability for my tasks and I incorporated progress photos and reflections to ensure clarity.\n\nWorking on this project was a deeply rewarding experience. I often lost track of time while immersed in design work or building in the workshop. I was fortunate to have an incredible team where each member brought unique strengths, and we resolved conflicts effectively using evidence-driven approaches. This experience showed me how teamwork and a structured engineering design process can make tackling large, real-world problems surprisingly easy.",
          "contentImages": ["/images/capstone/1.jpg", "/images/capstone/2.png", "/images/capstone/3.png", "/images/capstone/4.png", "/images/capstone/5.png", "/images/capstone/6.png", "/images/capstone/7.png", "/images/capstone/8.png", "/images/capstone/9.png", "/images/capstone/10.png", "/images/capstone/11.png", "/images/capstone/12.png", "/images/capstone/13.png", "/images/capstone/14.png", "/images/capstone/15.png", "/images/capstone/16.png", "/images/capstone/17.png", "/images/capstone/18.png", "/images/capstone/19.png", "/images/capstone/20.png", "/images/capstone/21.png", "/images/capstone/22.png", "/images/capstone/23.png"],
          "document": "/documents/BME462SymposiumPosterandFinalReports.pdf"
        },
        {
          "id": 1,
          "title": "Lacrosse Club",
          "subtitle": "University Athletics Club",
          "date": "2019 - 2024",
          "typeId": ["Personal"],
          "image": "/images/lax/cover.jpg",
          "content": "Choosing to study at the University of Waterloo (UW) was a difficult decision because it meant giving up playing lacrosse, a sport I loved, as UW did not have a team. Rather than leaving the sport behind, I took the initiative to establish a lacrosse club in my first year of university (2019), with the ambitious goal of eventually transforming it into a competitive OUA varsity team. What began as a personal project has now grown into a co-ed club making strides toward becoming a staple of the university’s athletic community.\n\nBefore my first year, I began preparing for the club by collecting donated equipment, reaching out to UW Athletics, and promoting the initiative through the Ontario Lacrosse Association. Establishing a new club was a challenging process, but by the fall of 2019, I was ready to showcase the club at the Warriors Athletic Club Expo. The ‘try-it’ sessions were a success, attracting 20 registered participants in the first term. Although the COVID-19 pandemic posed significant challenges, the continued engagement of our members ensured the club’s survival through those difficult times.\n\nAccessibility and inclusivity have been keys value of the club since its creation. Having experienced sports teams that were not always welcoming, I prioritized fostering a positive and supportive environment for everyone. I ensured that the club’s constitution reflected these values and worked to create a space where students could enjoy lacrosse regardless of their experience level. Even when the club reaches varsity status, the plan is to maintain a recreational option for students who prefer a less competitive atmosphere. This decision was partly inspired by the many Laurier students who expressed interest in joining our team, despite Laurier already having both men’s and women’s varsity lacrosse teams. We also partnered with organizations like the UW Alliance and the Black Liberated Athletes Coalition to learn how we could make the club a welcoming space for all students, regardless of their background. Further, membership fees were capped at $25, and I occasionally waived fees entirely to eliminate financial barriers to participation. To further reduce costs, I worked to secure equipment donations from local leagues, allowing players to try the sport without the upfront expense of purchasing their own gear. Over time, careful financial management and consistent grant applications enabled the team to purchase over 60 sticks, multiple nets, and a large stock of lacrosse balls. These funds also covered referee and travel expenses, allowing members to participate in home and away tournaments at no additional cost. \n\nAs president of the club, I chaired weekly executive meetings, planned practice sessions, and guided the club through its early growth stages. One of our biggest challenges was acquiring affordable equipment, as lacrosse is still a developing sport in the region. By reaching out to the right people and building community connections, we overcame these hurdles.\n\nAlthough I have since graduated from UW, I am incredibly proud of the legacy I left behind with the lacrosse club. Before graduating, I transitioned into an advisory role, writing an executive handbook to ensure continuity and offering guidance to the new leadership team. Seeing the club continue to flourish under new leadership has become one of my proudest accomplishments, as it reflects the collaboration and perseverance that went in to making the club a success.",
          "contentImages": ["/images/lax/1.png", "/images/lax/2.jpg", "/images/lax/3.jpg", "/images/lax/4.jpg", "/images/lax/5.jpg", "/images/lax/6.jpg", "/images/lax/7.jpg", "/images/lax/8.jpg", "/images/lax/9.png", "/images/lax/10.jpg", "/images/lax/11.jpeg", "/images/lax/12.jpg", "/images/lax/13.jpeg", "/images/lax/14.jpg", "/images/lax/15.jpeg", "/images/lax/16.png", "/images/lax/17.png"]
        },
        {
          "id": 2,
          "title": "Portfolio Website",
          "subtitle": "Personal ReactJS Project",
          "date": "2023",
          "typeId": ["Personal"],
          "image": "/images/website/cover.png",
          "content": "Many years ago, my dad purchased the stupalo.com domain, anticipating that one day either my brother or I would need it. That moment finally came during my summer co-op term in 2022, when I had the time to design and develop my personal portfolio website.\n\nI first attempted this project in 2020 using Webflow. However, I wasn’t satisfied with the initial design I created, and I felt I was missing an opportunity to learn how to develop a website from scratch. Revisiting the project in 2022, I decided to take a different approach, breaking the process down into four main stages: 1. Designing the screens and their relationships, 2. Implementing each screen using ReactJS, 3. Creating written and visual content for each section, and 4. Deploying the completed website.\n\nTo start, I taught myself the basics of Figma using its documentation and YouTube tutorials. I searched online for inspiration and created simple black-and-white wireframes of each screen. Once I was satisfied with the layout of the information, I added colors, icons, and fonts to make the design more cohesive and visually appealing. I sought feedback from friends and family before moving on to the next step.\n\nWith the screen designs and their relationships complete, I began learning ReactJS. I completed a tutorial from Codecademy to grasp the basics of the framework, then watched hours of YouTube tutorials before writing any code. These tutorials helped me understand how other developers organize their file systems, which tools they commonly use, and what advice they offer to beginners.\n\nRecognizing the importance of version control, I created a new GitHub repository to house my project. Using the ReactJS documentation, I set up a template ReactJS app. I decided to use styled-components instead of the traditional className styling approach, as styled-components can be reused more easily across the entire project.\n\nThe first step in every website is creating a navigation bar. Following a YouTube tutorial, I built a basic navbar, then customized the template code to match my own styles and functionality. Since my website has multiple pages, I incorporated React Router to manage the routes. With the navbar complete, I had a solid understanding of ReactJS and was able to build the home page, experience page, projects page, and footer components with ease.\n\nOnce the framework of the website was complete, it was time to create the content to replace the placeholder text and images I had used during development. I gathered photos that best represented the projects I wanted to showcase and wrote detailed descriptions for my homepage, work experiences, and projects. To streamline future updates, I stored all this content—along with image paths—in a single JSON file. This way, I could add or edit content without modifying any code.\n\nAt this point, I was incredibly proud of my website and eager to share it with anyone lucky enough to visit stupalo.com. The final step was deploying the site. Being a fan of free solutions, I chose GitHub Pages for deployment. With help from the GitHub Pages documentation and excellent customer support from BareMetal, my website was finally live at stupalo.com!",
          "contentImages": ["/images/website/1.png", "/images/website/2.png", "/images/website/3.png"]
        },
        {
          "id": 12,
          "title": "Knitted Knockers",
          "subtitle": "Handmade Breast Prostheses",
          "date": "2023 - Present",
          "typeId": ["Personal"],
          "image": "/images/knockers/cover.jpg",
          "content": "At the beginning of 2023, my mom was diagnosed with breast cancer. Although her diagnosis was caught early and had a high rate of survival, the news was devastating. In those first moments, it is impossible not to think of the worst possible outcome.\n\nAs I processed the news, I resolved to help her in any way I could. Fortunately, she was in the expert care of compassionate and skilled doctors, leaving little for me to do medically other than drive her to some of her appointments. That’s when I turned to something I could control: my hobby of crocheting. In my search for ways to support others battling breast cancer, I discovered Knitted Knockers, a remarkable organization of volunteers who handcraft breast prostheses for women who have undergone mastectomies or lumpectomies. These soft, comfortable, and beautifully made alternatives to traditional prosthetics help women reclaim a sense of normalcy.\n\nI immediately wanted to contribute. I downloaded their crochet pattern and sourced the approved yarn (Cascade Yarns Ultra Pima Cotton) in a range of skin-tone colours. My dad generously supported this effort, providing the funds for materials as we both saw the value in this cause.\n\nAfter delivering my initial batch, I learned an interesting detail: due to the nature of crochet stitches, the prostheses I had made were slightly stiffer than their knitted counterparts. These crocheted knockers were ideal for wearing while swimming, but I wanted to provide softer options for everyday wear as well. This realization inspired me to learn how to knit. Thanks to the detailed instructional videos prepared by the Knitted Knockers organization, I quickly got the hang of knitting and began creating softer prostheses. It was deeply rewarding to know that each piece I made could bring comfort to someone navigating a difficult chapter of their life. Since starting this journey, I’ve made over 50 knockers and counting. This work has become a meaningful way for me to give back, combining my love of crafting with the ability to support a community of women.\n\nThankfully, my mom’s treatment went smoothly, and by the end of 2023, she was declared cancer-free. Our family feels incredibly fortunate, and this experience has only deepened my commitment to supporting others through Knitted Knockers.",
          "contentImages": ["/images/knockers/1.jpg", "/images/knockers/2.jpg", "/images/knockers/3.jpg", "/images/knockers/4.jpg", "/images/knockers/5.jpg", "/images/knockers/6.jpg", "/images/knockers/7.jpg", "/images/knockers/8.jpg", "/images/knockers/9.jpg", "/images/knockers/10.jpg", "/images/knockers/11.jpg", "/images/knockers/12.jpg", "/images/knockers/13.jpg", "/images/knockers/14.jpg", "/images/knockers/15.jpg", "/images/knockers/16.jpg", "/images/knockers/17.jpg", "/images/knockers/18.jpg", "/images/knockers/19.jpg"]
        },
        {
          "id": 13,
          "title": "Ultrasound Device",
          "subtitle": "Medical Imaging Design Project",
          "date": "2022",
          "typeId": ["School"],
          "image": "/images/ultrasound/cover.png",
          "content": "During my 3B term in Fall 2022, I took BME 386 – The Physics of Medical Imaging. The final project for this course required me, along with four of my peers, to design and build an ultrasonic imaging device. This project had to use an Arduino HC-SR04 ultrasonic sensor and employ a single-pixel scanning method to create a 2D grayscale image. The ultrasonic sensor captured distances to the nearest obstruction at multiple locations along a 2D grid, which were then used to generate a pixelated image. Two design iterations were necessary for my group to successfully complete this project\n\nThe first design iteration used a turret mechanism, which rotated the ultrasonic sensor along two axes in a spiral pattern to capture the 2D image. For this design, I was responsible for creating a schematic which illustrated how the Arduino would interface with the ultrasonic sensor and control two stepper motors via motor drivers. I also designed 3D models for the mechanical parts, which I then 3D printed, and took the lead on soldering and constructing the device. My teammates sourced components and wrote the Arduino code to control the device and convert the distance measurements into an image. After constructing the device, we began testing it to ensure it was ready for our in-class demonstration. However, testing revealed a critical limitation of the ultrasonic sensor: its maximum effective measuring angle was only 15 degrees. Beyond this angle, the transmitted wave would not reach the ultrasonic receiver and thus could not be registered to create the image.\n\nTo address this limitation, we revised our design to ensure the sensor always faced straight on to the object being scanned. Initially, we considered using linear rail actuators, but this option was costly and would have delayed the project timeline. During a brainstorming session, we realized that my personal 3D printer could achieve the exact translational motion required and decided to pursue this immediate and cost-effective solution. To implement this approach, we first attempted to print a 2D sheet of zero thickness, which generated the desired 2D motion. However, the printer nozzle continued to heat unnecessarily, and the printer head moved too slowly for our needs. To overcome these issues, I adjusted the heat and speed settings within Cura, our slicing software. When Cura’s default constraints limited further improvements, I manually edited the G-code to disable the heating function and increase the printer’s speed. Additionally, we installed limit switches on each side of the 3D printer. These switches allowed the Arduino to track the ultrasonic sensor’s position as it scanned the grid, to allow for accurate image reconstruction.\n\nIn this second design iteration, I was responsible for creating an updated electrical schematic, designing and 3D printing mounts for the ultrasonic sensor and limit switches, and soldering and assembling the final device. The second design proved highly successful. Although we ran out of time to refine the image-generation algorithm, which resulted in visible horizontal lines in the images, our results were among the best in the class.",
          "contentImages": ["/images/ultrasound/1.png", "/images/ultrasound/2.png", "/images/ultrasound/3.png", "/images/ultrasound/4.png", "/images/ultrasound/5.png", "/images/ultrasound/6.png", "/images/ultrasound/7.png", "/images/ultrasound/8.png", "/images/ultrasound/9.png", "/images/ultrasound/10.png", "/images/ultrasound/11.png", "/images/ultrasound/12.png", "/images/ultrasound/13.jpg", "/images/ultrasound/14.png", "/images/ultrasound/15.jpg", "/images/ultrasound/16.png", "/images/ultrasound/17.jpg", "/images/ultrasound/18.png"],
          "document": "/documents/BME386ProjectFinalReport.pdf"
        },
        {
          "id": 3,
          "title": "Deadlift Analysis",
          "subtitle": "MOCAP Research Project",
          "date": "2022",
          "typeId": ["School"],
          "image": "/images/mocap/cover.png",
          "content": "In my 3A term (winter 2022) I took BME 588 – Special Topics in Biomechanics with a focus on Computational Biomechanics. Part of this course involved completing a biomechanical research project of choice. Since my partner and I had an interest in powerlifting and had often heard the claim that the rewards of deadlifts (one of the “big 3” lifts) were not worth the risks involved in the movement, we wanted to focus our research on proving whether or not this claim was true. Since our course had a significant focus on the OpenSim software, the objective of our study was to generate and validate two deadlifting motions (proper and improper form) in OpenSim with the purpose of contributing to combating this potential spread of misinformation in the powerlifting community.\n\nThe first step of this process involved collecting motion capture (MOCAP) data. Due to the multi-dimensional nature of human movement, this was accomplished using two different MOCAP techniques at once. The MOCAP setup involved two laptop cameras: one camera filming the anterior (front) view and one filming the right lateral (side) view of the deadlift subject. One of the two MOCAP techniques used was the MediaPipe Pose machine learning algorithm, which uses markerless pose tracking and background segmentation masking to infer the 3D location of 33 body landmarks. Note that none of these 33 landmarks were located along the spinal cord, therefore a second MOCAP technique was necessary to analyze spine curvature. The second MOCAP technique used a custom colour isolating algorithm which filtered by hue and saturation to isolate for the bright green markers which were glued onto our subject’s back. Before each deadlift recording was taken, the lights were flickered in order to sync the timing of each camera’s footage. We combined these datasets into the coordinate frame used by OpenSim by performing matrix transformations.\n\nOnce the MOCAP was finished we needed to translate our data from tables to a motion in OpenSim. This involved downloading the open source Full-Body Lifting model from SimTK, scaling the model based on our subject’s parameters, and placing markers on the model that coincided with each marker used during the data collection process. Once the markers were placed, we imported the MOCAP data as a motion file and ran an inverse kinematics simulation to visualise the motion of each subject. These models were then validated, and it was concluded that both motions were successfully created but with a degree of accuracy unsuitable for use in further research.\n\nI did not go into detail about it here, but we failed more times than we succeeded during this project and every small step forward became something to celebrate. Although this project was not successful, more than anything it taught me how to be resilient and how to work with any situation as grim as it may seem in the moment. Now it is easy to reflect and be extremely proud of what was accomplished during this project since we learned every technique and tool that we used in the moment while balancing the workload of 5 other courses.",
          "contentImages": ["/images/mocap/1.png", "/images/mocap/2.png", "/images/mocap/3.png", "/images/mocap/4.png", "/images/mocap/5.png"],
          "document": "/documents/BME588ProjectFinalReportCourchesneStupalo.pdf"
        },
        {
          "id": 4,
          "title": "Physiological Modelling",
          "subtitle": "Optimizing FES Parameters",
          "date": "2022",
          "typeId": ["School"],
          "image": "/images/optimization/cover.png",
          "content": "In my 3A term (winter 2022) I took BME 355 – Physiological Systems Modelling. The term project for this course involved developing a model to determine optimal parameters (amplitude and frequency) for functional electrical stimulation (FES). Currently, FES is one of the most effective treatments of footdrop; an issue that occurs when an individual’s tibialis anterior (shin) muscle does not work properly, and they can no longer lift their toes while they walk. As described by its name, an FES device periodically stimulates the patient’s tibialis anterior muscle using small controlled electrical signals. Although this is the preferred treatment by patients, one of its main drawbacks is that it overstimulates the targeted muscles and quickly fatigues the muscle. The parameters of focus for this project were signal frequency and amplitude. The goal of this project was to determine the optimal parameters for FES. Optimal parameters would successfully reduce muscle fatigue caused by FES while lifting the foot sufficiently off the ground to prevent foot drop.\n\nWe achieved our goal by creating a simplified model of the leg, shank, and foot which was fixed at the hip but free to rotate at the knee and ankle joints. Using that model and first principles, we then created state-space equations to describe our system. With MATLAB, these equations allowed us to quantitatively evaluate the relationship between the height of the foot off the ground and the frequency or amplitude of the input signal. An exhaustive search determined that the optimal frequency and amplitude to be 50Hz and 2.177V, respectively. We then ran a final simulation to verify that these values for amplitude and frequency produced realistic foot and ankle behaviour and ensured that both the front and back of the foot cleared the ground, preventing foot drop.\n\nMy main contributions to this project involved generating the models for our simulations, managing our team, creating our final presentation, and performing the optimization of the FES parameters of interest. Throughout the whole project I acted as the project manager and facilitated communication across our various sub teams. My efforts to thoroughly understand our model and simulations allowed me to keep my other group members informed. I also challenged our approach to ensure we were not making any irrational assumptions. My contributions kept the team on track and allowed us to successfully determine optimal FES parameters through modelling and simulation.",
          "contentImages": ["/images/optimization/1.png", "/images/optimization/2.png", "/images/optimization/3.png", "/images/optimization/4.png", "/images/optimization/5.png", "/images/optimization/6.png"],
          "document": "/documents/BME355FinalReportGroup3.pdf"
        },
        {
          "id": 10,
          "title": "Waterfall Coffee Table",
          "subtitle": "Woodworking",
          "date": "2022",
          "typeId": ["Personal"],
          "image": "/images/woodworking/cover.jpg",
          "content": "During my summer co-op term in 2022, I was fortunate to be living where I had access to a woodshop. Inspired by many of my boyfriend’s woodworking projects, I decided to collaborate with him to create a waterfall coffee table. We had previously seen this type of table in a jewelry shop and thought this project would be a great use for our leftover live edge walnut board while expanding our woodworking skills.\n\nWe began designing our table by sketching it on paper, carefully planning the proportions to ensure the use of 18-inch hairpin legs—which determine the table’s height—would leave sufficient material for the tabletop to be at least three feet long after cutting a portion of the board for the “waterfall” leg. After we were happy with the design, we measured 18 inches from one end of the plank and made a precise 45-degree cut using a miter saw. This type of angled cut was repeated on the remaining plank to form a miter joint, allowing the wood grain to flow seamlessly from the tabletop into the leg.\n\nOnce both planks were cut, we used walnut wood filler to fix any gouges and cracks in the wood. We then sanded each piece with 50, 100, 150, and 200 grit sandpaper to remove surface imperfections and make them smooth to the touch. Our next step involved gluing the two pieces together with wood glue. Although we had corner clamps, we decided not to use them since they would likely rip of the bark from the edges of the boards. Instead, we created a rig out of spare wood that allowed us to clamp the boards together at a 90-degree angle without damaging the bark.\n\nOnce the glue had dried, we sanded the joined pieces again to remove any glue residue. We used tack cloths and pressurized air to clear away all dust in preparation for applying the finish. We applied multiple coats of a polyurethane water-based wood finish to both the surfaces and bark, enhancing the natural beauty of the walnut and providing lasting protection.\n\nOnce the final coat of finish was dry, we attached 18-inch hairpin legs and secured them with two L-brackets on the underside of the table for added stability. The finished table was not only aesthetically pleasing but also incredibly functional for our apartment. This project provided me with valuable hands-on experience and introduced me to several new woodworking techniques.",
          "contentImages": ["/images/woodworking/1.jpg", "/images/woodworking/2.jpg", "/images/woodworking/3.jpg", "/images/woodworking/4.jpg", "/images/woodworking/5.jpg", "/images/woodworking/6.jpg", "/images/woodworking/7.jpg"]
        },
        {
          "id": 14,
          "title": "Crocheted Blanket",
          "subtitle": "Handmade Gift",
          "date": "2023",
          "typeId": ["Personal"],
          "image": "/images/blanket/cover.jpg",
          "content": "When my mom was diagnosed with breast cancer, our family faced a challenging and emotional journey. I wanted to create something special to comfort her during her many medical appointments and recovery periods. That’s how the idea for this blanket was born.\n\nTo start, I found a beautiful granny square design on Pinterest that I thought my mom would love. With this design in mind, I selected four yarn colours that she would appreciate, combining them to create a cheerful yet calming palette. Since this was my first large-scale crochet project, I was unsure if I could commit to finishing it. To ease my fears of wasting money, I opted for affordable acrylic yarn, each skein costing around $5.\n\nThe granny square pattern I chose featured three key components: a flower center, flower petals, and a flower border, all made with the coloured yarn. These elements were divided by white yarn sections, allowing me to create six distinct flower colour patterns. Once I completed a few squares, I laid them out on a standard throw blanket to determine the final size. I decided the blanket would be 10 squares wide by 12 squares long, requiring a total of 120 squares. This meant that I had to create 20 squares for each of the six colour variations.\n\nOver the course of several months, I worked on the squares whenever I could find time. Once all 120 squares were complete, I faced the daunting task of sewing in the loose ends—arguably the least enjoyable part of any crochet project! Looking back, I would handle this differently by weaving in ends as I go rather than saving them all for the end.\n\nWith the squares finished and tidied up, I arranged them in a repeating pattern and pinned them together. Using brown yarn, I joined the squares added a frilly border around the edges, giving it a polished and decorative touch.\n\nAfter approximately six months of on-and-off effort, the blanket was complete and has since resided on my mom’s chair in her living room.\n\nThis project taught me so much. Completing a long-term crochet endeavor gave me the confidence to take on more ambitious projects in the future. Today, I work exclusively with natural fibers despite the cost since I know I will put them to good use and they will result in a nicer finished product. Most importantly, I’m happy to share that my mom is now cancer-free, a relief and joy for our whole family.",
          "contentImages": ["/images/blanket/1.jpg", "/images/blanket/2.jpg", "/images/blanket/3.jpg", "/images/blanket/4.jpg", "/images/blanket/5.jpg", "/images/blanket/6.jpg", "/images/blanket/7.jpg", "/images/blanket/8.jpg", "/images/blanket/9.jpg", "/images/blanket/10.jpg", "/images/blanket/11.jpg", "/images/blanket/12.jpg"]
        },
        {
          "id": 5,
          "title": "Upright",
          "subtitle": "Peripheral Neuropathy Solution",
          "date": "2021",
          "typeId": ["School"],
          "image": "/images/upright/cover.png",
          "content": "During my 2B term in summer 2022, I took a course called Prototyping, Simulation and Design (BME 261). In this course my peers and I were tasked with designing and creating a prototype solution for peripheral neuropathy patients. In short, peripheral neuropathy is a neurodegenerative disease that causes patients to experience tingling, pain, or even loss of sensation in their hands or feet, significantly increasing their risk of falls. The focus of my group’s project was to create a wearable device to help prevent falls by providing haptic feedback based on foot pressure.\n\nWe designed a smart sock that recorded pressure at the foot and relayed the information through vibrations at the knee or a higher point, depending on the patient’s needs. To tackle this project efficiently, we divided our team into two subgroups: technical report writing and prototyping. As the lead of the prototyping team, I was responsible for designing circuits, conducting verification testing, programming the Arduino Uno, 3D modeling and printing a protective case, and assembling the final prototype.\n\nThe heart of our system was an Arduino Uno, and we used Fritzing to design the circuits on a breadboard. Before we could assemble our circuits, we needed to determine the optimal secondary resistor to use in a voltage divider with the resistance sensors embedded in the insole. To do this, we built a test circuit with an interchangeable secondary resistor, allowing us to measure the output voltage read by the Arduino Uno. During testing, a subject walked over the insole, and we recorded data for each resistor value at multiple foot landmarks over three trials. This data allowed us to select the resistor that provided the largest sensing range for pressure variations at critical points.\n\nTo ensure the device was wearable and robust, I 3D-modeled a protective case in OnShape which securely housed the Arduino Uno and a 9V battery. After 3D printing the case, we soldered all components together and integrated them into the sock prototype.\n\nThis project was not only a rewarding design challenge but also a valuable opportunity to gain hands-on experience managing a project from concept to completion. It enhanced my circuit design, 3D modeling, prototyping, and collaboration skills while addressing a real-world problem.",
          "contentImages": ["/images/upright/1.png", "/images/upright/2.png", "/images/upright/3.png", "/images/upright/4.png", "/images/upright/5.png", "/images/upright/6.png", "/images/upright/7.png"],
          "document": "/documents/BME261ProjectFinalReport.pdf"
        },
        {
          "id": 8,
          "title": "Trebuchet",
          "subtitle": "Grade 12 Physics Project",
          "date": "2019",
          "typeId": ["School"],
          "image": "/images/trebuchet/cover.png",
          "content": "In my Grade 12 physics class, our final project was to design and build a trebuchet that maximized launch distance and accuracy while minimizing weight. To prepare, I researched various trebuchet styles by exploring informational websites, hobbyist blogs, and YouTube videos. One video on optimizing trebuchet design introduced me to the whipper trebuchet, a compact and efficient style. Inspired by the creator’s use of CNC machining, I decided to construct my project from a single sheet of plywood, straying away from the traditional 2x4 construction typically seen in my class.\n\nThe whipper trebuchet's forward-focused design allowed me to concentrate the weight on the side panels, using minimal material for lateral stabilization. I began by sketching designs on paper and used physics principles to predict the velocity of the release hook based on different arm lengths and weight placements. Once I determined the optimal configuration, I transitioned to OnShape for detailed digital designs, modeling both the structural wood components and custom 3D-printed parts.\n\nKey 3D-printed components included a custom trigger and launch hook. The trigger featured attachment points for both the loading string and the launch string, which allowed me to launch the trebuchet from a safe distance. The launch hook was designed to slide over the arm and be secured with screws; it provided a fixed attachment point for one side of the sling and a hook for releasing the other side during launch.\n\nUsing OnShape, I optimized the layout of the wooden components to fit a single 4’x8’x¾’’ sheet of plywood. Additional hardware—such as brackets, bearings, hairpin clips, and axles - was procured from a hardware store.\n\nI built the trebuchet in my basement using my parents’ tools and conducted test launches at a vacant soccer field. Through experimentation with weights and hook angles, I tuned the device to achieve maximum distance and accuracy. During the live demonstration at school, these optimizations paid off, earning me a great mark for the project.\n\nAfterward, my teacher requested that I donate the trebuchet to the school as an example for future students, which I was honored to do.",
          "contentImages": ["/images/trebuchet/1.png", "/images/trebuchet/2.png", "/images/trebuchet/3.png", "/images/trebuchet/4.png", "/images/trebuchet/5.png", "/images/trebuchet/6.png", "/images/trebuchet/7.png", "/images/trebuchet/8.jpg", "/images/trebuchet/9.png", "/images/trebuchet/10.png", "/images/trebuchet/11.png", "/images/trebuchet/12.png", "/images/trebuchet/13.png", "/images/trebuchet/14.jpg"]
        },
        {
          "id": 9,
          "title": "Deck",
          "subtitle": "Family Project",
          "date": "2013 - 2016",
          "typeId": ["Personal"],
          "image": "/images/deck/cover.jpg",
          "content": "At my parents’ house, it often feels like the home improvement projects are endless. When I was 13, we decided it was finally time to transform our 25-year-old deck from a splintered eyesore, into a stunning composite feature that would truly enhance our home. My parents led the project, with support from my brother and I, since we were eager to contribute and learn from the experience. We collaborated to design a warm and inviting backyard deck featuring plenty of seating that would be perfect for both large family gatherings and intimate get-togethers. Our design featured a spacious dining area on one side, a Muskoka-inspired fireplace on the other, and an open space in the middle for additional creative use. We used AutoCAD to bring our ideas to life, ensuring the design was both accurate and achievable.\n\nConstruction began with the demolition of the old deck. We quickly got to work regrading the deck site to ensure proper drainage. To support the new deck’s weight, we had ten-inch concrete piles professionally installed according to our drawings. We then installed the pressure treated frame using 2x12 beams and 2x10 joists at 12” centres. This heavy-duty construction was necessary because composite decking, while beautiful, is not as strong as wood and requires substantial support.\n\nOnce the frame was in place, we meticulously aligned the boards using a laser to ensure precision along the house. Each board was carefully cut with our custom-modified 'finger-safe' powered mitre saw. The frame was assembled with an array of framing brackets, nails, and screws, all designed for a low-profile finish. To keep the look clean, we cantilevered the frame to hide the concrete piles, creating a seamless edge around the deck. The four bench seats were then further cantilevered beyond the deck’s edge, adding a striking visual dimension.\n\nThe frame was then clad with composite deck boards in a diagonal herringbone pattern. All of the deck boards and the fascia boards were fastened using hidden hardware, resulting in a smooth surface with no visible screws.\n\nThe end result is a stunning deck that has earned endless compliments from our guests, filling me with a great sense of pride. I am grateful to have worked alongside my family on this two-year project and am happy to report that the project was injury-free!",
          "contentImages": ["/images/deck/1.jpg", "/images/deck/2.jpg", "/images/deck/3.png", "/images/deck/4.jpg", "/images/deck/5.jpg", "/images/deck/6.jpg", "/images/deck/7.jpg", "/images/deck/8.jpg", "/images/deck/9.jpg"]
        }
      ]
    },
    "awards":{

    },
    "footer":{
      "text": "Sophie Stupalo 2024",
      "linkText": "CC BY-SA 4.0",
      "copyrightUrl": "https://creativecommons.org/licenses/by-sa/4.0/",
      "linkedinUrl": "https://www.linkedin.com/in/sophie-stupalo-2380a3194/",
      "githubUrl": "https://github.com/sstupalo",
      "envelopeUrl": "mailto:sophie@stupalo.com",
      "phoneUrl": "tel:6476339839"
    }
  }